{
  "tiers": [
    {
      "name": "Drinking",
      "color": "#FF6F61",
      "image": "wine-glass.png",
      "cards": [
        "Sip your drink, then tease your partner with a slow, sensual striptease for 30 seconds.",
        "Take a shot, then kiss your partner's inner thigh with lingering lips.",
        "Toast, then describe in explicit detail a fantasy involving you both in a public place.",
        "Sip slowly, then trace your partner's body with an ice cube from your drink.",
        "Drink, then challenge your partner to remove one piece of clothing seductively.",
        "Take a shot and perform a 1-minute lap dance, focusing on slow, teasing moves.",
        "Sip, then whisper an explicit bedroom request in your partner's ear.",
        "Toast, then nibble your partner's lower lip during a passionate kiss.",
        "Drink, then use your tongue to trace a path from your partner's neck to their chest.",
        "Take a shot, then challenge your partner to a 'sexy truth or dare' question.",
        "Sip and slide your hand under your partner's shirt for a teasing caress.",
        "Drink, then blindfold your partner and describe an erotic scenario for 1 minute.",
        "Toast, then kiss your partner's most sensitive spot for 30 seconds.",
        "Sip, then challenge your partner to mimic a provocative dance move.",
        "Take a shot, then leave a trail of kisses down your partner's spine."
      ]
    },
    {
      "name": "Tier 1",
      "color": "#D8BFD8",
      "image": "intertwined-hands.png",
      "cards": [
        "Massage your partner's inner thighs with warm oil for 2 minutes.",
        "Kiss your partner's neck while slowly unbuttoning their shirt.",
        "Use your fingertips to explore your partner's body under their clothes for 1 minute.",
        "Whisper an explicit fantasy about a secret rendezvous while kissing their ear.",
        "Blindfold your partner and tease their chest with feather-light touches.",
        "Slowly remove one piece of your partner's clothing and kiss the exposed skin.",
        "Trace your partner's lips with your tongue before a deep, slow kiss.",
        "Massage your partner's lower back while whispering what you want to do next.",
        "Gently bite your partner's shoulder while pressing your body against theirs.",
        "Explore your partner's body with slow, deliberate kisses for 2 minutes.",
        "Tease your partner's sensitive spots with your breath, avoiding direct touch.",
        "Undress your partner halfway and describe how their body turns you on.",
        "Use a silk scarf to lightly bind your partner's hands, then kiss their wrists.",
        "Whisper an explicit compliment about your partner's body, then touch that spot.",
        "Guide your partner's hands to explore your body while you describe the sensation."
      ]
    },
    {
      "name": "Tier 2",
      "color": "#008B8B",
      "image": "couple-embrace.png",
      "cards": [
        "Blindfold your partner and use a feather to tease their erogenous zones for 2 minutes.",
        "Slowly undress your partner completely, kissing each newly exposed area.",
        "Act out a 2-minute foreplay scene in a role-play setting of your choice.",
        "Use your tongue to explore your partner's body from neck to navel.",
        "Tease your partner with a 1-minute striptease, ending in just underwear.",
        "Whisper an explicit fantasy involving toys, then act out a tame version.",
        "Massage your partner with warm oil, focusing on their most sensitive areas.",
        "Challenge your partner to a 2-minute make-out session with hands roaming freely.",
        "Use ice to trace your partner's body, followed by warm kisses on the same path.",
        "Describe an explicit bedroom scenario, then act out the opening move.",
        "Blindfold your partner and guide their hands to touch you intimately.",
        "Perform a slow, sensual dance while your partner can only watch, no touching."
      ]
    },
    {
      "name": "Tier 3",
      "color": "#DC143C",
      "image": "lips-closeup.png",
      "cards": [
        "Act out an explicit 3-minute role-play scenario chosen by your partner.",
        "Use a toy (if available) to tease your partner's sensitive spots for 2 minutes.",
        "Explore your partner's body with your tongue, focusing on their favorite areas.",
        "Blindfold and lightly restrain your partner, then tease them with touches for 3 minutes.",
        "Describe a detailed, explicit fantasy and act out one part for 2 minutes.",
        "Perform a 2-minute erotic massage with oil, focusing on intimate areas.",
        "Challenge your partner to a 3-minute foreplay session with no kissing allowed.",
        "Use a silk scarf to tease your partner's body, followed by slow kisses.",
        "Act out a spicy bedroom scene from a movie you both know, 3 minutes.",
        "Take turns teasing each other's most sensitive spots with hands and lips."
      ]
    },
    {
      "name": "Punishment",
      "color": "#1C2526",
      "image": "suggestive-silhouette.png",
      "cards": [
        "Act out a 5-minute explicit role-play with a dominant/submissive dynamic.",
        "Blindfold, restrain, and tease your partner with a toy or feather for 4 minutes.",
        "Perform an erotic dance, then let your partner direct your next moves.",
        "Explore your partner's body with your tongue for 4 minutes, no limits on areas.",
        "Create and act out a detailed, explicit fantasy scenario for 5 minutes.",
        "Take turns being in control for a 5-minute intense foreplay session.",
        "Use ice, oil, and hands to tease your partner's entire body for 4 minutes.",
        "Challenge your partner to a 5-minute session of mutual, explicit exploration."
      ]
    }
  ]
}
