{
  "tiers": [
    {
      "name": "Drinking",
      "color": "#FF6F61",
      "accent": "#FF69B4",
      "image": "drinking-tier-banks-leash.png",
      "cards": [
        "Banks sips his drink, then commands Emma to stroke his cock through his pants while kneeling.",
        "Banks drinks and orders Emma to share a filthy fantasy about submitting to him, then kiss his feet.",
        "Banks toasts, then commands Emma to strip one item and beg for a sensual spanking.",
        "Banks sips slowly, ordering Emma to rub her pussy under the table while staring submissively.",
        "Banks takes a shot, then commands Emma to grind on his lap with hands cuffed (use scarf if no cuffs).",
        "Banks drinks, then orders Emma to kneel and tease his cock with a feather toy while begging.",
        "Banks sips and commands Emma to describe how she'll suck his cock, using a vibrator on herself.",
        "Banks drinks, then orders Emma to give a submissive lap dance while he holds a leash toy.",
        "Banks downs a shot; Emma must mimic his orgasm moans while submitting to a light whip tease.",
        "Banks sips, then commands Emma to write 'Banks' slut' on her thigh with edible ink and kiss it.",
        "Banks drinks and orders Emma to play a sexy 'Truth or Dare,' daring her to use a blindfold toy.",
        "Banks toasts, commanding Emma to lick whiskey off his chest while collared (use toy collar).",
        "Banks sips, ordering Emma to remove panties and present them submissively to him.",
        "Banks drinks, then commands Emma to role-play a submissive bar hookup, teasing with a small plug.",
        "Banks takes a swig, ordering Emma to pour drink on her breasts and beg him to suck them."
      ]
    },
    {
      "name": "Tier 1",
      "color": "#D8BFD8",
      "accent": "#9370DB",
      "image": "tier1-emma-bound.png",
      "cards": [
        "Banks commands Emma to give a 2-minute oily handjob, submitting with a blindfold toy.",
        "Banks orders Emma to kiss his inner thighs while collared, begging to please him.",
        "Banks commands Emma to trace his cock with ice, then submit to his touch on her clit.",
        "Banks orders Emma to share a fantasy of being fucked by him, kneeling with a toy plug.",
        "Banks commands Emma to nibble his balls submissively while cuffed (use belt if no cuffs).",
        "Banks orders Emma to suck his fingers like a dildo, maintaining submissive eye contact.",
        "Banks commands Emma to rub her pussy with a vibrator while he watches and directs.",
        "Banks orders Emma to give a submissive foot massage with lotion, kissing each toe.",
        "Banks commands Emma to beg for his cock, then kiss his shaft while collared.",
        "Banks holds Emma's face, ordering a deep, submissive kiss while she remains still.",
        "Banks commands Emma to edge herself with a toy while begging for his permission to cum.",
        "Banks orders Emma to massage his shoulders submissively, holding a bondage rope toy.",
        "Banks commands Emma to trail kisses up his cock, presenting wrists for light cuffing.",
        "Banks orders Emma to describe her submissive scent, then submit to his sniffing and licking.",
        "Banks blindfolds Emma, commanding her to stroke his cock with a soft toy whip."
      ]
    },
    {
      "name": "Tier 2",
      "color": "#008B8B",
      "accent": "#20B2AA",
      "image": "tier2-banks-collar.png",
      "cards": [
        "Banks blindfolds Emma, commanding her to finger her pussy while he narrates her submission.",
        "Banks role-plays master, ordering Emma to take a paddle spanking then suck his cock.",
        "Banks commands Emma to use a vibrator on her clit while begging to be his fucktoy.",
        "Banks orders Emma to describe submitting to his cock, then act it out with bound hands.",
        "Banks ties Emma's hands, commanding her to deep-throat his cock submissively.",
        "Banks orders Emma to take a plug in her ass while he fingers her pussy, submitting fully.",
        "Banks commands Emma to watch porn and masturbate with a dildo to his rhythm.",
        "Banks role-plays doctor, ordering Emma to spread for an intimate toy inspection.",
        "Banks lubes Emma, commanding a slippery tit-fuck while she wears a harness toy.",
        "Banks denies Emma's orgasm, edging her with a wand toy until she begs loudly.",
        "Banks commands Emma to take ice on her clit, then hot breath from him, using a toy.",
        "Banks orders a creampie role-play, commanding Emma to take his thrusts with lube."
      ]
    },
    {
      "name": "Tier 3",
      "color": "#DC143C",
      "accent": "#FF4500",
      "image": "tier3-emma-whip.png",
      "cards": [
        "Banks commands Emma to take a strap-on face-fuck while kneeling in submission.",
        "Banks role-plays master, whipping Emma's ass then fucking her doggy-style with a toy.",
        "Banks orders Emma to cum on a high-vibe toy while he films (delete after, consensual).",
        "Banks commands Emma to play his submissive escort, fucked on a table with cuffs.",
        "Banks orders Emma to deep-throat him, then take anal fingering with a lubed plug.",
        "Banks commands Emma to take lotion 'cum' shots on her face, submitting to his orders.",
        "Banks ties Emma, edging her with a vibrator and tongue until she begs to serve.",
        "Banks orders Emma to role-play his slave, submitting to toy penetration and dirty talk.",
        "Banks commands Emma to take warm lube drips, submitting to wet toy fucking.",
        "Banks orders a toy gangbang role-play, commanding Emma to take multiple insertions."
      ]
    },
    {
      "name": "Punishment",
      "color": "#1C2526",
      "accent": "#FF0000",
      "image": "punishment-banks-cuffs.png",
      "cards": [
        "Banks spanks Emma's ass red, then commands hard doggy fucking with a toy slap.",
        "Banks denies Emma's orgasm 10 times, edging with nipple clamps and a vibrator.",
        "Banks collars Emma, commanding her to suck his cock for 3 minutes in submission.",
        "Banks orders rough anal play, lubing Emma and pounding with a toy while she begs.",
        "Banks uses clamps on Emma's nipples, commanding throat-fucking until submissive tears.",
        "Banks commands a breeding role-play, ordering Emma to take deep thrusts and cum talk.",
        "Banks ties Emma spread-eagle, teasing with feathers, ice, and a high-vibe toy.",
        "Banks punishes Emma with a toy barrage, commanding multiple penetrations as she obeys."
      ]
    }
  ]
}
