{
  "tiers": [
    {
      "name": "Drinking",
      "color": "#FF6F61",
      "accent": "#FF69B4",
      "image": "drinking-tier-banks-emma-toast.png",
      "cards": [
        "Banks and Emma sip drinks, then take turns stroking each other's genitals through clothes.",
        "Banks and Emma drink, then share a filthy fantasy about fucking each other, kissing passionately.",
        "Banks and Emma toast, then strip one item each and trade sensual nipple licks.",
        "Banks and Emma sip slowly, rubbing each other's cocks/pussies under the table with eye contact.",
        "Banks and Emma take shots, then grind together with hands bound (use cuffs or scarf).",
        "Banks and Emma drink, then tease each other's cocks/clits with a feather toy, moaning softly.",
        "Banks and Emma sip, describing how they'll fuck each other, using a vibrator on low.",
        "Banks and Emma drink, then give each other a mutual lap dance with a leash toy shared.",
        "Banks and Emma down shots, mimicking each other's orgasm faces while stroking skin.",
        "Banks and Emma sip, writing 'fuck me' on each other's thighs with edible ink, then licking it.",
        "Banks and Emma drink, playing a sexy 'Truth or Dare' with toy penalties (e.g., blindfold).",
        "Banks and Emma toast, licking whiskey off each other's chests while kissing.",
        "Banks and Emma sip, stripping panties/pants and trading them for a mutual tease.",
        "Banks and Emma drink, role-playing a bar hookup, fingering each other with a small plug.",
        "Banks and Emma swig, pouring drinks on each other's bodies and licking them off together."
      ]
    },
    {
      "name": "Tier 1",
      "color": "#D8BFD8",
      "accent": "#9370DB",
      "image": "tier1-banks-emma-hands.png",
      "cards": [
        "Banks and Emma give each other a 2-minute oily handjob/fingering with a blindfold toy.",
        "Banks and Emma kiss each other's inner thighs, moaning and sharing a toy collar.",
        "Banks and Emma trace each other's bodies with ice, ending at cocks/pussies for licks.",
        "Banks and Emma share a fantasy of mutual fucking, using a toy plug together.",
        "Banks and Emma nibble each other's asses, hands bound with cuffs or a belt.",
        "Banks and Emma suck each other's fingers like dildos, locking eyes passionately.",
        "Banks and Emma rub each other's pussies/cocks with a shared vibrator, trading moans.",
        "Banks and Emma give mutual foot massages with lotion, kissing toes sensually.",
        "Banks and Emma compliment each other's cocks/pussies, licking the praised spots.",
        "Banks and Emma hold each other's faces, sharing a deep, spit-swapping kiss.",
        "Banks and Emma edge each other with a toy, taking turns with a vibrator.",
        "Banks and Emma massage each other's shoulders, trading a bondage rope toy.",
        "Banks and Emma trail kisses up each other's cocks/pussies, wrists lightly cuffed.",
        "Banks and Emma describe each other's sexual scents, then lick and kiss them.",
        "Banks and Emma blindfold each other, trading strokes with a soft toy whip."
      ]
    },
    {
      "name": "Tier 2",
      "color": "#008B8B",
      "accent": "#20B2AA",
      "image": "tier2-banks-emma-embrace.png",
      "cards": [
        "Banks and Emma blindfold each other, fingering pussies/cocks while moaning together.",
        "Banks and Emma role-play lovers, spanking each other with a paddle toy, then oral.",
        "Banks and Emma use a vibrator on each other's clits/cocks, trading control.",
        "Banks and Emma describe mutual fuck fantasies, acting them out with bound hands.",
        "Banks and Emma tie each other lightly, trading deep oral with passionate kisses.",
        "Banks and Emma insert plugs in each other's asses, fingering pussies/cocks together.",
        "Banks and Emma watch porn, jerking each other off with a dildo to the rhythm.",
        "Banks and Emma role-play doctors, probing each other with gloved fingers or toys.",
        "Banks and Emma lube up, sliding bodies together with a shared harness toy.",
        "Banks and Emma edge each other's orgasms, trading a wand toy and loud moans.",
        "Banks and Emma use ice and hot breath on each other's clits/cocks, sharing a toy.",
        "Banks and Emma role-play a creampie, fucking with lube and toy insertions."
      ]
    },
    {
      "name": "Tier 3",
      "color": "#DC143C",
      "accent": "#FF4500",
      "image": "tier3-banks-emma-lips.png",
      "cards": [
        "Banks and Emma take turns fucking each other's faces with a strap-on toy.",
        "Banks and Emma role-play lovers, whipping each other's asses, then fucking doggy-style.",
        "Banks and Emma use a high-vibe toy to make each other cum, filming (delete after).",
        "Banks and Emma play escorts, fucking on a table with shared cuffs.",
        "Banks and Emma deep-throat each other, then trade anal fingering with a plug.",
        "Banks and Emma drip lotion 'cum' on each other's faces, licking it off together.",
        "Banks and Emma tie each other, edging with vibrators and tongues until climax.",
        "Banks and Emma role-play lovers, fucking with toys and dirty talk together.",
        "Banks and Emma drip warm lube on each other, fucking with wet toys.",
        "Banks and Emma role-play a gangbang, trading toy penetrations and moans."
      ]
    },
    {
      "name": "Punishment",
      "color": "#1C2526",
      "accent": "#FF0000",
      "image": "punishment-banks-emma-cuffs.png",
      "cards": [
        "Banks and Emma spank each other's asses red, then fuck hard doggy-style with toys.",
        "Banks and Emma edge each other's orgasms 10 times with clamps and vibrators.",
        "Banks and Emma collar each other, trading 3-minute oral sessions with passion.",
        "Banks and Emma lube up, trading rough anal play with toys and loud moans.",
        "Banks and Emma use nipple clamps, throat-fucking each other with shared intensity.",
        "Banks and Emma role-play breeding, thrusting deeply with cum talk and toys.",
        "Banks and Emma tie each other spread-eagle, teasing with feathers, ice, and toys.",
        "Banks and Emma trade toy penetrations, screaming in mutual pleasure."
      ]
    }
  ]
}
